In [139]:
import pandas as pd
import numpy as np
df = pd.read_csv('/Users/exam/Documents/Nishant/ML/titanic-csv.csv')
print(df)

                                                  Name PClass    Age     Sex  \
0                         Allen, Miss Elisabeth Walton    1st  29.00  female
1                          Allison, Miss Helen Loraine    1st   2.00  female
2                  Allison, Mr Hudson Joshua Creighton    1st  30.00    male
3        Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  25.00  female
4                        Allison, Master Hudson Trevor    1st   0.92    male
5                                   Anderson, Mr Harry    1st  47.00    male
6                     Andrews, Miss Kornelia Theodosia    1st  63.00  female
7                               Andrews, Mr Thomas, jr    1st  39.00    male
8         Appleton, Mrs Edward Dale (Charlotte Lamson)    1st  58.00  female
9                               Artagaveytia, Mr Ramon    1st  71.00    male
10                           Astor, Colonel John Jacob    1st  47.00    male
11    Astor, Mrs John Jacob (Madeleine Talmadge Force)    1st  19.00  female
12                        Aubert, Mrs Leontine Pauline    1st    NaN  female
13                            Barkworth, Mr Algernon H    1st    NaN    male
14                                  Baumann, Mr John D    1st    NaN    male
15      Baxter, Mrs James (Helene DeLaudeniere Chaput)    1st  50.00  female
16                             Baxter, Mr Quigg Edmond    1st  24.00    male
17                                 Beattie, Mr Thomson    1st  36.00    male
18                        Beckwith, Mr Richard Leonard    1st  37.00    male
19     Beckwith, Mrs Richard Leonard (Sallie Monypeny)    1st  47.00  female
20                                Behr, Mr Karl Howell    1st  26.00    male
21                                  Birnbaum, Mr Jakob    1st  25.00    male
22                              Bishop, Mr Dickinson H    1st  25.00    male
23              Bishop, Mrs Dickinson H (Helen Walton)    1st  19.00  female
24             Bjornstrm-Steffansson, Mr Mauritz Hakan    1st  28.00    male
25                         Blackwell, Mr Stephen Weart    1st  45.00    male
26                                     Blank, Mr Henry    1st  39.00    male
27                              Bonnell, Miss Caroline    1st  30.00  female
28                             Bonnell, Miss Elizabeth    1st  58.00  female
29                             Borebank, Mr John James    1st    NaN    male
...                                                ...    ...    ...     ...
1283               Vestrom, Miss Hulda Amanda Adolfina    3rd  14.00  female
1284                                    Vonk, Mr Jenko    3rd  22.00    male
1285                                Ware, Mr Frederick    3rd    NaN    male
1286                        Warren, Mr Charles William    3rd    NaN    male
1287                                  Wazli, Mr Yousif    3rd    NaN    male
1288                                  Webber, Mr James    3rd    NaN    male
1289                     Wennerstrom, Mr August Edvard    3rd    NaN    male
1290                                Wenzel, Mr Linhart    3rd    NaN    male
1291                        Widegren, Mr Charles Peter    3rd  51.00    male
1292                          Wiklund, Mr Jacob Alfred    3rd  18.00    male
1293                                 Wilkes, Mrs Ellen    3rd  45.00  female
1294                                  Willer, Mr Aaron    3rd    NaN    male
1295                                 Willey, Mr Edward    3rd    NaN    male
1296                          Williams, Mr Howard Hugh    3rd    NaN    male
1297                               Williams, Mr Leslie    3rd  28.00    male
1298                                Windelov, Mr Einar    3rd  21.00    male
1299                                   Wirz, Mr Albert    3rd  27.00    male
1300                             Wiseman, Mr Phillippe    3rd    NaN    male
1301                           Wittevrongel, Mr Camiel    3rd  36.00    male
1302                                 Yalsevac, Mr Ivan    3rd    NaN    male
1303                                Yasbeck, Mr Antoni    3rd  27.00    male
1304                               Yasbeck, Mrs Antoni    3rd  15.00  female
1305                                Youssef, Mr Gerios    3rd    NaN    male
1306                               Zabour, Miss Hileni    3rd    NaN  female
1307                               Zabour, Miss Tamini    3rd    NaN  female
1308                                Zakarian, Mr Artun    3rd  27.00    male
1309                            Zakarian, Mr Maprieder    3rd  26.00    male
1310                                  Zenni, Mr Philip    3rd  22.00    male
1311                                  Lievens, Mr Rene    3rd  24.00    male
1312                                    Zimmerman, Leo    3rd  29.00    male

      Survived  SexCode
0            1        1
1            0        1
2            0        0
3            0        1
4            1        0
5            1        0
6            1        1
7            0        0
8            1        1
9            0        0
10           0        0
11           1        1
12           1        1
13           1        0
14           0        0
15           1        1
16           0        0
17           0        0
18           1        0
19           1        1
20           1        0
21           0        0
22           1        0
23           1        1
24           1        0
25           0        0
26           1        0
27           1        1
28           1        1
29           0        0
...        ...      ...
1283         0        1
1284         0        0
1285         0        0
1286         0        0
1287         0        0
1288         0        0
1289         1        0
1290         0        0
1291         0        0
1292         0        0
1293         1        1
1294         0        0
1295         0        0
1296         0        0
1297         0        0
1298         0        0
1299         0        0
1300         0        0
1301         0        0
1302         1        0
1303         0        0
1304         1        1
1305         0        0
1306         0        1
1307         0        1
1308         0        0
1309         0        0
1310         0        0
1311         0        0
1312         0        0

[1313 rows x 6 columns]

In [111]:
df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [112]:
df['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [113]:
df['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [114]:
df['PClass'].nunique()

4

In [115]:
df[df['Age'].isnull()].head()

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0
14            Baumann, Mr John D    1st  NaN    male         0        0
29       Borebank, Mr John James    1st  NaN    male         0        0
32            Bradley, Mr George    1st  NaN    male         1        0

## Sum of Age

In [116]:
df['Age'].isnull().sum()

557

## Replace NaN with 0s

In [121]:
df['Age'].replace(np.nan,0)
print(df)

                                                  Name PClass    Age     Sex  \
0                         Allen, Miss Elisabeth Walton    1st  29.00  female
1                          Allison, Miss Helen Loraine    1st   2.00  female
2                  Allison, Mr Hudson Joshua Creighton    1st  30.00    male
3        Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  25.00  female
4                        Allison, Master Hudson Trevor    1st   0.92    male
5                                   Anderson, Mr Harry    1st  47.00    male
6                     Andrews, Miss Kornelia Theodosia    1st  63.00  female
7                               Andrews, Mr Thomas, jr    1st  39.00    male
8         Appleton, Mrs Edward Dale (Charlotte Lamson)    1st  58.00  female
9                               Artagaveytia, Mr Ramon    1st  71.00    male
10                           Astor, Colonel John Jacob    1st  47.00    male
11    Astor, Mrs John Jacob (Madeleine Talmadge Force)    1st  19.00  female
12                        Aubert, Mrs Leontine Pauline    1st    NaN  female
13                            Barkworth, Mr Algernon H    1st    NaN    male
14                                  Baumann, Mr John D    1st    NaN    male
15      Baxter, Mrs James (Helene DeLaudeniere Chaput)    1st  50.00  female
16                             Baxter, Mr Quigg Edmond    1st  24.00    male
17                                 Beattie, Mr Thomson    1st  36.00    male
18                        Beckwith, Mr Richard Leonard    1st  37.00    male
19     Beckwith, Mrs Richard Leonard (Sallie Monypeny)    1st  47.00  female
20                                Behr, Mr Karl Howell    1st  26.00    male
21                                  Birnbaum, Mr Jakob    1st  25.00    male
22                              Bishop, Mr Dickinson H    1st  25.00    male
23              Bishop, Mrs Dickinson H (Helen Walton)    1st  19.00  female
24             Bjornstrm-Steffansson, Mr Mauritz Hakan    1st  28.00    male
25                         Blackwell, Mr Stephen Weart    1st  45.00    male
26                                     Blank, Mr Henry    1st  39.00    male
27                              Bonnell, Miss Caroline    1st  30.00  female
28                             Bonnell, Miss Elizabeth    1st  58.00  female
29                             Borebank, Mr John James    1st    NaN    male
...                                                ...    ...    ...     ...
1283               Vestrom, Miss Hulda Amanda Adolfina    3rd  14.00  female
1284                                    Vonk, Mr Jenko    3rd  22.00    male
1285                                Ware, Mr Frederick    3rd    NaN    male
1286                        Warren, Mr Charles William    3rd    NaN    male
1287                                  Wazli, Mr Yousif    3rd    NaN    male
1288                                  Webber, Mr James    3rd    NaN    male
1289                     Wennerstrom, Mr August Edvard    3rd    NaN    male
1290                                Wenzel, Mr Linhart    3rd    NaN    male
1291                        Widegren, Mr Charles Peter    3rd  51.00    male
1292                          Wiklund, Mr Jacob Alfred    3rd  18.00    male
1293                                 Wilkes, Mrs Ellen    3rd  45.00  female
1294                                  Willer, Mr Aaron    3rd    NaN    male
1295                                 Willey, Mr Edward    3rd    NaN    male
1296                          Williams, Mr Howard Hugh    3rd    NaN    male
1297                               Williams, Mr Leslie    3rd  28.00    male
1298                                Windelov, Mr Einar    3rd  21.00    male
1299                                   Wirz, Mr Albert    3rd  27.00    male
1300                             Wiseman, Mr Phillippe    3rd    NaN    male
1301                           Wittevrongel, Mr Camiel    3rd  36.00    male
1302                                 Yalsevac, Mr Ivan    3rd    NaN    male
1303                                Yasbeck, Mr Antoni    3rd  27.00    male
1304                               Yasbeck, Mrs Antoni    3rd  15.00  female
1305                                Youssef, Mr Gerios    3rd    NaN    male
1306                               Zabour, Miss Hileni    3rd    NaN  female
1307                               Zabour, Miss Tamini    3rd    NaN  female
1308                                Zakarian, Mr Artun    3rd  27.00    male
1309                            Zakarian, Mr Maprieder    3rd  26.00    male
1310                                  Zenni, Mr Philip    3rd  22.00    male
1311                                  Lievens, Mr Rene    3rd  24.00    male
1312                                    Zimmerman, Leo    3rd  29.00    male

      Survived  SexCode
0            1        1
1            0        1
2            0        0
3            0        1
4            1        0
5            1        0
6            1        1
7            0        0
8            1        1
9            0        0
10           0        0
11           1        1
12           1        1
13           1        0
14           0        0
15           1        1
16           0        0
17           0        0
18           1        0
19           1        1
20           1        0
21           0        0
22           1        0
23           1        1
24           1        0
25           0        0
26           1        0
27           1        1
28           1        1
29           0        0
...        ...      ...
1283         0        1
1284         0        0
1285         0        0
1286         0        0
1287         0        0
1288         0        0
1289         1        0
1290         0        0
1291         0        0
1292         0        0
1293         1        1
1294         0        0
1295         0        0
1296         0        0
1297         0        0
1298         0        0
1299         0        0
1300         0        0
1301         0        0
1302         1        0
1303         0        0
1304         1        1
1305         0        0
1306         0        1
1307         0        1
1308         0        0
1309         0        0
1310         0        0
1311         0        0
1312         0        0

[1313 rows x 6 columns]

## Return sex is not male

In [123]:
df[df['Sex']!='male'].head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [128]:
df[df.index!=0].head()

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0

In [130]:
df.drop_duplicates().head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [127]:
df.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [131]:
df.drop_duplicates(subset=['Sex'],keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [134]:
df.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [135]:
df.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [140]:
df.groupby(['Survived','Sex'])['Age'].mean()

Survived  Sex
0         female    24.901408
          male      32.320780
1         female    30.867143
          male      25.951875
Name: Age, dtype: float64

In [153]:
time_index = pd.date_range('06/06/2017',periods=100000,freq='30s')
df1 = pd.DataFrame(index=time_index)
df1['Sale_Amount'] = np.random.randint(1,10,100000)
df1.resample('W').sum()

            Sale_Amount
2017-06-11        86134
2017-06-18       100602
2017-06-25       101138
2017-07-02       101085
2017-07-09       100505
2017-07-16        10291

In [154]:
df1.resample('M').count()

            Sale_Amount
2017-06-30        72000
2017-07-31        28000

In [161]:
df1.resample('2W').mean()

            Sale_Amount
2017-06-11     4.984606
2017-06-25     5.003472
2017-07-09     4.999752
2017-07-23     4.947596

## Looping over a column

In [160]:
for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

## Reading a function over all elements in a column by creating function

In [164]:
def uppercase(x):
    return x.upper()
df['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

## Applying function to a group

In [166]:
df.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851